; domain
(define (domain shakeys-world)
  (:requirements [:strips] [:equality] [:typing] [:adl])
  (:types box room small-object)
  (:predicates
   (shakey-in-room ?r - room)
   (door ?r1 ?r2 - room)
   (wide-door ?r1 ?r2 - room)
   (object-in-room ?o - small-object ?r - room)
   (light-on ?r - room)
   (box-in-room ?b - box ?r - room)
   (holding-in-left ?o - small-object)
   (holding-in-right ?o - small-object))
  (:action go-to-room
           :parameters (?r1 ?r2 - room)
           :precondition (and (shakey-in-room ?r1)
                              (or (door ?r1 ?r2)
                                  (wide-door ?r1 ?r2)))
           :effect (and (shakey-in-room ?r2)
                        (not (shakey-in-room ?r1))))
  (:action turn-on-light
           :parameters (?r - room)
           :precondition (and (not (light-on ?r))
                              (shakey-in-room ?r)
                              (exists (?b - box) (box-in-room ?b ?r)))
           :effect (light-on ?r))
  (:action push-to-room
           :parameters (?b - box ?r1 ?r2 - room)
           :precondition (and (shakey-in-room ?r1)
                              (box-in-room ?b ?r1)
                              (wide-door ?r1 ?r2))
           :effect (and (box-in-room ?b ?r2)
                        (not (box-in-room ?b ?r1))))
  (:action pick-up-left
           :parameters (?o - small-object ?r - room)
           :precondition (and (shakey-in-room ?r)
                              (object-in-room ?o ?r)
                              (not (exists (?ox - small-object) (holding-in-left ?ox)))
                              (light-on ?r))
           :effect (and (not (object-in-room ?o ?r))
                        (holding-in-left ?o)))
  (:action pick-up-right
           :parameters (?o - small-object ?r - room)
           :precondition (and (shakey-in-room ?r)
                              (object-in-room ?o ?r)
                              (not (exists (?ox - small-object) (holding-in-right ?ox)))
                              (light-on ?r))
           :effect (and (not (object-in-room ?o ?r))
                        (holding-in-right ?o)))
  (:action drop-left
           :parameters (?o - small-object ?r - room)
           :precondition (and (shakey-in-room ?r)
                              (holding-in-left ?o))
           :effect (and (object-in-room ?o ?r)
                        (not (holding-in-left ?o))))
  (:action drop-right
           :parameters (?o - small-object ?r - room)
           :precondition (and (shakey-in-room ?r)
                              (holding-in-right ?o))
           :effect (and (object-in-room ?o ?r)
                        (not (holding-in-right ?o))))
  )

; problem
(define (problem shakeys-problem)
  (:domain shakeys-world)
  (:objects
   room1 room2 room3 - room
   b - box
   rubber-duck ball - small-object)
  (:init
   (wide-door room1 room2) (wide-door room2 room1)
   (wide-door room2 room3) (wide-door room3 room2)
   (door room2 room3) (door room3 room2)
   (shakey-in-room room2)
   (box-in-room b room1)
   (object-in-room rubber-duck room1)
   (object-in-room ball room2))
  (:goal (forall (?o - small-object) (object-in-room ?o room3)))
  )

; plan
1. (go-to-room room2 room1)
   deleted: (shakey-in-room room2)
   added: (shakey-in-room room1)
   goals met: 0 of 1
2. (turn-on-light room1)
   added: (light-on room1)
   goals met: 0 of 1
3. (push-to-room b room1 room2)
   deleted: (box-in-room b room1)
   added: (box-in-room b room2)
   goals met: 0 of 1
4. (pick-up-left rubber-duck room1)
   deleted: (object-in-room rubber-duck room1)
   added: (holding-in-left rubber-duck)
   goals met: 0 of 1
5. (go-to-room room1 room2)
   deleted: (shakey-in-room room1)
   added: (shakey-in-room room2)
   goals met: 0 of 1
6. (turn-on-light room2)
   added: (light-on room2)
   goals met: 0 of 1
7. (pick-up-right ball room2)
   deleted: (object-in-room ball room2)
   added: (holding-in-right ball)
   goals met: 0 of 1
8. (go-to-room room2 room3)
   deleted: (shakey-in-room room2)
   added: (shakey-in-room room3)
   goals met: 0 of 1
9. (drop-right ball room3)
   deleted: (holding-in-right ball)
   added: (object-in-room ball room3)
   goals met: 0 of 1
10. (drop-left rubber-duck room3)
   deleted: (holding-in-left rubber-duck)
   added: (object-in-room rubber-duck room3)
   goals met: 1 of 1
